attacker/data/ac+scaling/spoofing/ab_results/ab_17.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   98.309 seconds
Complete requests:      20
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    1
Total transferred:      244 bytes
HTML transferred:       95 bytes
Requests per second:    0.20 [#/sec] (mean)
Time per request:       49154.576 [ms] (mean)
Time per request:       4915.458 [ms] (mean, across all concurrent requests)
Transfer rate:          0.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  108 456.9      6    2049
Processing:     4 4819 21516.0      8   96230
Waiting:        0 4811 21517.1      0   96227
Total:          8 4927 21972.9     14   98280

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     15
  80%     16
  90%     16
  95%  98280
  98%  98280
  99%  98280
 100%  98280 (longest request)
