attacker/data/ac+scaling/spoofing/ab_results/ab_35.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   83.092 seconds
Complete requests:      20
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    1
Total transferred:      244 bytes
HTML transferred:       95 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       41546.143 [ms] (mean)
Time per request:       4154.614 [ms] (mean, across all concurrent requests)
Transfer rate:          0.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  155 227.6    205    1036
Processing:     9 4147 18258.8    101   81720
Waiting:        0 4086 18271.9      0   81715
Total:         22 4302 18466.7    306   82756

Percentage of the requests served within a certain time (ms)
  50%    306
  66%    307
  75%    308
  80%    308
  90%    309
  95%  82756
  98%  82756
  99%  82756
 100%  82756 (longest request)
