attacker/data/ac+scaling/spoofing/ab_results/ab_46.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   30.911 seconds
Complete requests:      20
Failed requests:        0
Keep-Alive requests:    20
Total transferred:      4880 bytes
HTML transferred:       1900 bytes
Requests per second:    0.65 [#/sec] (mean)
Time per request:       15455.322 [ms] (mean)
Time per request:       1545.532 [ms] (mean, across all concurrent requests)
Transfer rate:          0.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11  40.2      4     182
Processing:   158 2004 6412.3    478   29207
Waiting:      158 2004 6412.2    478   29207
Total:        158 2015 6452.4    478   29389

Percentage of the requests served within a certain time (ms)
  50%    478
  66%    787
  75%   1040
  80%   1110
  90%   1183
  95%  29389
  98%  29389
  99%  29389
 100%  29389 (longest request)
